{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задания на практику 1.3\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1. Определите среднее значение всех элементов последовательности, завершающейся числом 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x = int(input())\n",
    "s = 0\n",
    "l = 0\n",
    "if x == 0:\n",
    "    print (0)\n",
    "if x != 0:\n",
    "    while x:\n",
    "        s = s + x \n",
    "        l = l + 1 \n",
    "        x = int(input())\n",
    "print(s / l)\n",
    "    \n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "2. Определите количество четных элементов в последовательности, завершающейся числом 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "324754\n",
      "Четные - 3\n",
      "Нечетные - 3\n"
     ]
    }
   ],
   "source": [
    "x = int(input())\n",
    "o = 0\n",
    "n = 0\n",
    "while x > 0:\n",
    "  if x % 2 == 0:\n",
    "    o += 1\n",
    "  else:\n",
    "    n += 1\n",
    "  x = x // 10\n",
    "print('Четные -', o)\n",
    "print('Нечетные -', n)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "3. Последовательность чисел вводится до 0. Найти мин и макс.\n",
    "№исправлено"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "x = int(input())\n",
    "\n",
    "max = 0\n",
    "min = 0\n",
    "\n",
    "while x != 0:\n",
    "    if x > max:\n",
    "        max = x\n",
    "    else:\n",
    "        min = x\n",
    "    x = int(input())\n",
    "print(\"Максимум\", max)\n",
    "print(\"Минимум\",min)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "4. Последовательность состоит из различных натуральных чисел и завершается 0. Опр. значение 2-го по величине элемента в этой последовательности. В последовательности должно быть хотя бы 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n",
      "4\n",
      "5\n",
      "10\n",
      "0\n",
      "5\n"
     ]
    }
   ],
   "source": [
    "a = int(input())\n",
    "max1 = 0\n",
    "max2 = 0\n",
    "\n",
    "while a != 0:\n",
    "    if a > max1:\n",
    "        max2 = max1\n",
    "        max1 = a\n",
    "    elif a > max2:\n",
    "        max2 = a\n",
    "    a = int(input())\n",
    "print (max2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "5. N факториал какого числа?\n",
    "#исправлено"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "f = 1 #факториал\n",
    "x = 1\n",
    "while (x <= n):\n",
    "    f = f * x\n",
    "    x += 1\n",
    "print(\"Факториал числа\", n,\"равен\", f)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "6. Дана последовательность натуральных чисел, заверш. числом 0. Определите, какое наибольшее число подряд идущих элементов этой последовательности равны друг другу.\n",
    "#исправлено"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "a0 = -1\n",
    "l = 0 #текущая длина\n",
    "n = 0 #искомая длина\n",
    "a = int(input()) \n",
    "while a != 0:\n",
    "    if a == a0:\n",
    "        l += 1\n",
    "    else:\n",
    "        a0 = a\n",
    "        n = max(n,l)\n",
    "        l = 1\n",
    "    a = int(input()) \n",
    "n = max(n,l)\n",
    "print('Ответ: ',n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "a. Дано целое число, не меньшее 2. Выведите его наименьший натуральный делитель, отличный от 1."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8\n",
      "2\n"
     ]
    }
   ],
   "source": [
    "a = int(input()) # делитель\n",
    "b = 2 #целое число\n",
    "\n",
    "while a % b != 0:\n",
    "  b += 1\n",
    "print(b)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "b. По данному натуральному числу N найдите наибольшую целую степнь двойки, не превосходящую N. Выведите показатель степени и саму степень. Операцией возведения в степень пользоваться нельзя!\n",
    "#исправлено"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "8\n",
      "8 64\n"
     ]
    }
   ],
   "source": [
    "n = int(input()) \n",
    "b = 2 #степень\n",
    "i = 1 #после возведения\n",
    "\n",
    "while b <= n:\n",
    "  b *= 2\n",
    "  i += 1\n",
    "print(i - 1, b // 2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "с. Спортсмен +10% и номер дня"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6\n",
      "15\n",
      "11\n"
     ]
    }
   ],
   "source": [
    "x = int(input())\n",
    "y = int(input()) \n",
    "n = x #номер дня\n",
    "k = 1\n",
    "\n",
    "while n <= y:\n",
    "  k += 1\n",
    "  n *= 1.1\n",
    "print (k)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
